src/ex_Tabakon/Documents/ОтчетОРозничныхПродажах.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ОтчетОРозничныхПродажах</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СуммаВозвратов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Магазин</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Магазины</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Эквайрер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СуммаОплатыНаличных</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>КассаККМ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КассыККМ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Продавец</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>QR</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ОплатаПлатежнымиКартами</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>АкцизныеМарки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>АкцизнаяМарка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ШтрихкодыУпаковокТоваров</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/ex_Tabakon/Enums/ВидыОперацийЧекККМ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ВидыОперацийЧекККМ</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Продажа</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Возврат</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/ex_Tabakon/Enums/СтатусыЧековККМ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>СтатусыЧековККМ</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Пробитый</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Архивный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Отложенный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Аннулированный</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/ex_Tabakon/Enums/ХозяйственныеОперации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ХозяйственныеОперации</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СдачаДенежныхСредствВБанк</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВыдачаДенежныхСредствВДругуюОрганизацию</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ОплатаПоставщику</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВыдачаДенежныхСредствВДругуюКассу</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВозвратОплатыКлиенту</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВыдачаДенежныхСредствВКассуККМ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПрочиеРасходы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПрочиеДоходы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВыдачаДенежныхСредствИзКассыККМ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПоступлениеДенежныхСредствИзКассыККМ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВозвратОтПокупателя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПоступлениеОплатыОтКлиента</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/ex_Tabakon/Documents/ПриходныйКассовыйОрдер.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ПриходныйКассовыйОрдер</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Приложение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>КассаККМ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КассыККМ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Касса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Кассы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НомерЧекаККМ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>8</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПробиватьЧекиПоКассеККМ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ХозяйственнаяОперация</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ХозяйственныеОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПробитЧек</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СменаЗакрыта</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ОтчетОРозничныхПродажах</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ОтчетОРозничныхПродажах</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/ex_Tabakon/Documents/РасходныйКассовыйОрдер.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>РасходныйКассовыйОрдер</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Касса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Кассы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ХозяйственнаяОперация</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ХозяйственныеОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Контрагент</Name>
					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>КассаККМ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КассыККМ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НомерЧекаККМ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>8</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СменаЗакрыта</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПробиватьЧекиПоКассеККМ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПробитЧек</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ОтчетОРозничныхПродажах</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ОтчетОРозничныхПродажах</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>РасшифровкаПлатежа</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>СтатьяДвиженияДенежныхСредств</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтатьиДвиженияДенежныхСредств</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/ex_Tabakon/Documents/ОтчетОРозничныхПродажах/Ext/ManagerModule.bsl
&Вместо("СоздатьВТДокументыНаККМ")
Процедура ТБКСоздатьВТДокументыНаККМ(МенеджерВременныхТаблиц, КассоваяСмена, СсылкаНаОтчет)
	УстановитьПривилегированныйРежим(Истина);

	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("КассаККМ", КассоваяСмена.КассаККМ);
	Запрос.УстановитьПараметр("НачалоКассовойСмены", КассоваяСмена.НачалоКассовойСмены);
	Запрос.УстановитьПараметр("ОкончаниеКассовойСмены", КассоваяСмена.ОкончаниеКассовойСмены);
	Запрос.УстановитьПараметр("ОтчетОРозничныхПродажах", СсылкаНаОтчет);
	
	Если ЗначениеЗаполнено(СсылкаНаОтчет) Тогда
		
		Запрос.Текст =
		"ВЫБРАТЬ
		|	Док.Ссылка КАК Ссылка,
		|	Док.ВидОперации КАК ВидОперации,
		|	Док.ДисконтнаяКарта КАК ДисконтнаяКарта,
		|	Док.ЧекККМПродажа КАК ЧекККМПродажа,
		|	Док.ОперацияСДенежнымиСредствами КАК ОперацияСДенежнымиСредствами,
		|	Док.ВыручкаНаличными КАК ВыручкаНаличными,
		|	ВЫБОР
		|		КОГДА Док.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийЧекККМ.Возврат)
		|				И Док.ОтчетОРозничныхПродажах <> &ОтчетОРозничныхПродажах
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК ЭтоВозвратПослеЗакрытияСмены,
		|	ВЫБОР
		|		КОГДА Док.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийЧекККМ.Продажа)
		|			ТОГДА 1
		|		ИНАЧЕ -1
		|	КОНЕЦ КАК КоэффициентВидаОплаты,
		|	Док.АналитикаХозяйственнойОперации КАК АналитикаХозяйственнойОперации
		|ПОМЕСТИТЬ втТаблицаЧеков
		|ИЗ
		|	Документ.ЧекККМ КАК Док
		|ГДЕ
		|	Док.КассаККМ = &КассаККМ
		|	И Док.Проведен
		|	И НЕ Док.СтатусЧекаККМ = ЗНАЧЕНИЕ(Перечисление.СтатусыЧековККМ.Аннулированный)
		|	И НЕ Док.СтатусЧекаККМ = ЗНАЧЕНИЕ(Перечисление.СтатусыЧековККМ.Отложенный)
		|	И Док.ОтчетОРозничныхПродажах = &ОтчетОРозничныхПродажах
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПриходныйКассовыйОрдер.Ссылка КАК Ссылка,
		|	ПриходныйКассовыйОрдер.Контрагент КАК Контрагент,
		|	ПриходныйКассовыйОрдер.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
		|	ЗНАЧЕНИЕ(Справочник.ВидыОплатЧекаККМ.Наличные) КАК ВидОплаты,
		|	ПриходныйКассовыйОрдер.СуммаДокумента КАК СуммаПоступления,
		|	0 КАК СуммаВозврата
		|ПОМЕСТИТЬ втДокументыНаККМ
		|ИЗ
		|	Документ.ПриходныйКассовыйОрдер КАК ПриходныйКассовыйОрдер
		|ГДЕ
		|	ПриходныйКассовыйОрдер.КассаККМ = &КассаККМ
		|	И ПриходныйКассовыйОрдер.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПоступлениеОплатыОтКлиента)
		|	И ПриходныйКассовыйОрдер.ПробиватьЧекиПоКассеККМ
		|	И ПриходныйКассовыйОрдер.Проведен
		|	И ПриходныйКассовыйОрдер.ОтчетОРозничныхПродажах = &ОтчетОРозничныхПродажах
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	РасходныйКассовыйОрдер.Ссылка,
		|	РасходныйКассовыйОрдер.Контрагент,
		|	РасходныйКассовыйОрдер.ХозяйственнаяОперация,
		|	ЗНАЧЕНИЕ(Справочник.ВидыОплатЧекаККМ.Наличные),
		|	0,
		|	РасходныйКассовыйОрдер.СуммаДокумента
		|ИЗ
		|	Документ.РасходныйКассовыйОрдер КАК РасходныйКассовыйОрдер
		|ГДЕ
		|	РасходныйКассовыйОрдер.КассаККМ = &КассаККМ
		|	И РасходныйКассовыйОрдер.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратОплатыКлиенту)
		|	И РасходныйКассовыйОрдер.ПробиватьЧекиПоКассеККМ
		|	И РасходныйКассовыйОрдер.Проведен
		|	И РасходныйКассовыйОрдер.ОтчетОРозничныхПродажах = &ОтчетОРозничныхПродажах
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ОплатаОтПокупателяПлатежнойКартой.Ссылка,
		|	ОплатаОтПокупателяПлатежнойКартой.Контрагент,
		|	ОплатаОтПокупателяПлатежнойКартой.ХозяйственнаяОперация,
		|	ОплатаОтПокупателяПлатежнойКартой.ВидОплаты,
		|	ВЫБОР
		|		КОГДА ОплатаОтПокупателяПлатежнойКартой.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПоступлениеОплатыОтКлиента)
		|			ТОГДА ОплатаОтПокупателяПлатежнойКартой.СуммаДокумента
		|		ИНАЧЕ 0
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА НЕ ОплатаОтПокупателяПлатежнойКартой.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратОплатыКлиенту)
		|			ТОГДА 0
		|		ИНАЧЕ ОплатаОтПокупателяПлатежнойКартой.СуммаДокумента
		|	КОНЕЦ
		|ИЗ
		|	Документ.ОплатаОтПокупателяПлатежнойКартой КАК ОплатаОтПокупателяПлатежнойКартой
		|ГДЕ
		|	ОплатаОтПокупателяПлатежнойКартой.КассаККМ = &КассаККМ
		|	И ОплатаОтПокупателяПлатежнойКартой.ПробиватьЧекиПоКассеККМ
		|	И ОплатаОтПокупателяПлатежнойКартой.Проведен
		|	И ОплатаОтПокупателяПлатежнойКартой.ОтчетОРозничныхПродажах = &ОтчетОРозничныхПродажах";
		
	Иначе
		
		Запрос.Текст =
		"ВЫБРАТЬ
		|	Док.Ссылка КАК Ссылка,
		|	Док.ВидОперации КАК ВидОперации,
		|	Док.ДисконтнаяКарта КАК ДисконтнаяКарта,
		|	Док.ЧекККМПродажа КАК ЧекККМПродажа,
		|	Док.ОперацияСДенежнымиСредствами КАК ОперацияСДенежнымиСредствами,
		|	Док.ВыручкаНаличными КАК ВыручкаНаличными,
		|	ВЫБОР
		|		КОГДА Док.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийЧекККМ.Возврат)
		|				И Док.ЧекККМПродажа.СтатусЧекаККМ = ЗНАЧЕНИЕ(Перечисление.СтатусыЧековККМ.Архивный)
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК ЭтоВозвратПослеЗакрытияСмены,
		|	ВЫБОР
		|		КОГДА Док.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийЧекККМ.Продажа)
		|			ТОГДА 1
		|		ИНАЧЕ -1
		|	КОНЕЦ КАК КоэффициентВидаОплаты,
		|	Док.АналитикаХозяйственнойОперации КАК АналитикаХозяйственнойОперации
		|ПОМЕСТИТЬ втТаблицаЧеков
		|ИЗ
		|	Документ.ЧекККМ КАК Док
		|ГДЕ
		|	Док.КассаККМ = &КассаККМ     
		
		//Изменил Вик 2025-09-29
		//|	И (Док.Дата МЕЖДУ &НачалоКассовойСмены И &ОкончаниеКассовойСмены
		//|			ИЛИ &ОкончаниеКассовойСмены = ДАТАВРЕМЯ(1, 1, 1))    
		|	И (Док.Дата МЕЖДУ &НачалоКассовойСмены И &ТекущаяДата)   
		
		|	И Док.Проведен
		|	И НЕ Док.СтатусЧекаККМ = ЗНАЧЕНИЕ(Перечисление.СтатусыЧековККМ.Архивный)
		|	И НЕ Док.СтатусЧекаККМ = ЗНАЧЕНИЕ(Перечисление.СтатусыЧековККМ.Аннулированный)
		|	И НЕ Док.СтатусЧекаККМ = ЗНАЧЕНИЕ(Перечисление.СтатусыЧековККМ.Отложенный)
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПриходныйКассовыйОрдер.Ссылка КАК Ссылка,
		|	ПриходныйКассовыйОрдер.Контрагент КАК Контрагент,
		|	ПриходныйКассовыйОрдер.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
		|	ЗНАЧЕНИЕ(Справочник.ВидыОплатЧекаККМ.Наличные) КАК ВидОплаты,
		|	ПриходныйКассовыйОрдер.СуммаДокумента КАК СуммаПоступления,
		|	0 КАК СуммаВозврата
		|ПОМЕСТИТЬ втДокументыНаККМ
		|ИЗ
		|	Документ.ПриходныйКассовыйОрдер КАК ПриходныйКассовыйОрдер
		|ГДЕ
		|	ПриходныйКассовыйОрдер.КассаККМ = &КассаККМ
		|	И ПриходныйКассовыйОрдер.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПоступлениеОплатыОтКлиента)
		|	И ПриходныйКассовыйОрдер.ПробиватьЧекиПоКассеККМ
		|	И ПриходныйКассовыйОрдер.Проведен
		|	И НЕ ПриходныйКассовыйОрдер.СменаЗакрыта
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	РасходныйКассовыйОрдер.Ссылка,
		|	РасходныйКассовыйОрдер.Контрагент,
		|	РасходныйКассовыйОрдер.ХозяйственнаяОперация,
		|	ЗНАЧЕНИЕ(Справочник.ВидыОплатЧекаККМ.Наличные),
		|	0,
		|	РасходныйКассовыйОрдер.СуммаДокумента
		|ИЗ
		|	Документ.РасходныйКассовыйОрдер КАК РасходныйКассовыйОрдер
		|ГДЕ
		|	РасходныйКассовыйОрдер.КассаККМ = &КассаККМ
		|	И РасходныйКассовыйОрдер.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратОплатыКлиенту)
		|	И РасходныйКассовыйОрдер.ПробиватьЧекиПоКассеККМ
		|	И РасходныйКассовыйОрдер.Проведен
		|	И НЕ РасходныйКассовыйОрдер.СменаЗакрыта
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ОплатаОтПокупателяПлатежнойКартой.Ссылка,
		|	ОплатаОтПокупателяПлатежнойКартой.Контрагент,
		|	ОплатаОтПокупателяПлатежнойКартой.ХозяйственнаяОперация,
		|	ОплатаОтПокупателяПлатежнойКартой.ВидОплаты,
		|	ВЫБОР
		|		КОГДА ОплатаОтПокупателяПлатежнойКартой.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПоступлениеОплатыОтКлиента)
		|			ТОГДА ОплатаОтПокупателяПлатежнойКартой.СуммаДокумента
		|		ИНАЧЕ 0
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА НЕ ОплатаОтПокупателяПлатежнойКартой.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратОплатыКлиенту)
		|			ТОГДА 0
		|		ИНАЧЕ ОплатаОтПокупателяПлатежнойКартой.СуммаДокумента
		|	КОНЕЦ
		|ИЗ
		|	Документ.ОплатаОтПокупателяПлатежнойКартой КАК ОплатаОтПокупателяПлатежнойКартой
		|ГДЕ
		|	ОплатаОтПокупателяПлатежнойКартой.КассаККМ = &КассаККМ
		|	И ОплатаОтПокупателяПлатежнойКартой.ПробиватьЧекиПоКассеККМ
		|	И ОплатаОтПокупателяПлатежнойКартой.Проведен
		|	И НЕ ОплатаОтПокупателяПлатежнойКартой.СменаЗакрыта";
		
	КонецЕсли;	
	//Запрос.УстановитьПараметр("дата", ТекущаяДата() - 24*60*60);       
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДата());

	Запрос.Выполнить();
	
	УстановитьПривилегированныйРежим(Ложь);

КонецПроцедуры

// Дополняет отчет после типового заполнения по чекам: пустые характеристики и QR. Через эту процедуру
// идут закрытие смены и команда «Заполнить по чекам ККМ» в списке отчетов; QR уходит в УТ при обмене.
//
&После("ЗаполнитьОтчетОРозничныхПродажахПоДаннымВЧеках")
Процедура ТБКЗаполнитьОтчетОРозничныхПродажахПоДаннымВЧекахПосле(ОтчетОРозничныхПродажах, МенеджерВременныхТаблиц = Неопределено, Отказ = Ложь)
	
	Если Отказ Тогда
		Возврат; // по чекам заполнять нечем либо вызывающий уже отказался - дополнять нечего
	КонецЕсли;
	
	// Характеристика - раньше QR: марки сопоставляются со строками по номенклатуре и характеристике.
	ТБКЗаполнитьПустыеХарактеристикиПоЦене(ОтчетОРозничныхПродажах);
	ТБКЗаполнитьQRПоАкцизнымМаркам(ОтчетОРозничныхПродажах);
	
КонецПроцедуры

// Строкам товаров без характеристики, у номенклатуры которых используются характеристики, подбирает
// характеристику этой номенклатуры с наименованием, равным цене строки (как Строка(Цена)): характеристика
// хранит МРЦ. Помеченные на удаление не берутся. Если подходящей характеристики нет, строка не меняется,
// и отчет не пройдет типовую проверку заполнения.
// Страховка Вик 2024-08-20, до 29.09.2026 жила в ОбработкаПроверкиЗаполнения модуля объекта.
//
// Параметры:
//  ДокументОбъект - ДокументОбъект.ОтчетОРозничныхПродажах - заполненный отчет.
//
Процедура ТБКЗаполнитьПустыеХарактеристикиПоЦене(ДокументОбъект)
	
	СтрокиБезХарактеристики = Новый ТаблицаЗначений;
	СтрокиБезХарактеристики.Колонки.Добавить("НомерСтроки", Новый ОписаниеТипов("Число"));
	СтрокиБезХарактеристики.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	СтрокиБезХарактеристики.Колонки.Добавить("Наименование",
		Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(100)));
	
	Для Каждого СтрокаТовары Из ДокументОбъект.Товары Цикл
		Если Не ЗначениеЗаполнено(СтрокаТовары.Характеристика) Тогда
			НоваяСтрока = СтрокиБезХарактеристики.Добавить();
			НоваяСтрока.НомерСтроки = СтрокаТовары.НомерСтроки;
			НоваяСтрока.Номенклатура = СтрокаТовары.Номенклатура;
			НоваяСтрока.Наименование = Строка(СтрокаТовары.Цена);
		КонецЕсли;
	КонецЦикла;
	
	Если СтрокиБезХарактеристики.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СтрокиБезХарактеристики.НомерСтроки КАК НомерСтроки,
	|	СтрокиБезХарактеристики.Номенклатура КАК Номенклатура,
	|	СтрокиБезХарактеристики.Наименование КАК Наименование
	|ПОМЕСТИТЬ ВТСтрокиБезХарактеристики
	|ИЗ
	|	&СтрокиБезХарактеристики КАК СтрокиБезХарактеристики
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура,
	|	Наименование
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТСтроки.НомерСтроки КАК НомерСтроки,
	|	МАКСИМУМ(Характеристики.Ссылка) КАК Характеристика
	|ИЗ
	|	ВТСтрокиБезХарактеристики КАК ВТСтроки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СпрНоменклатура
	|		ПО ВТСтроки.Номенклатура = СпрНоменклатура.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ХарактеристикиНоменклатуры КАК Характеристики
	|		ПО ВТСтроки.Номенклатура = Характеристики.Владелец
	|			И ВТСтроки.Наименование = Характеристики.Наименование
	|ГДЕ
	|	СпрНоменклатура.ВидНоменклатуры.ИспользоватьХарактеристики
	|	И НЕ Характеристики.ПометкаУдаления
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТСтроки.НомерСтроки";
	Запрос.УстановитьПараметр("СтрокиБезХарактеристики", СтрокиБезХарактеристики);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ДокументОбъект.Товары[Выборка.НомерСтроки - 1].Характеристика = Выборка.Характеристика;
	КонецЦикла;
	
КонецПроцедуры

// Заполняет QR строк товаров кодами маркировки из табличной части АкцизныеМарки:
// марка дописывается во все строки с ее номенклатурой и характеристикой, разделитель - Символ(169).
// Прежние QR сбрасываются, поэтому повторный вызов по тому же отчету их не задваивает.
//
// Параметры:
//  ДокументОбъект - ДокументОбъект.ОтчетОРозничныхПродажах - заполненный отчет.
//
Процедура ТБКЗаполнитьQRПоАкцизнымМаркам(ДокументОбъект)
	
	Для Каждого СтрокаТовары Из ДокументОбъект.Товары Цикл
		СтрокаТовары.QR = "";
	КонецЦикла;
	
	Если ДокументОбъект.АкцизныеМарки.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Марки.Ссылка КАК АкцизнаяМарка,
	|	Марки.Номенклатура КАК Номенклатура,
	|	Марки.Характеристика КАК Характеристика
	|ИЗ
	|	Справочник.ШтрихкодыУпаковокТоваров КАК Марки
	|ГДЕ
	|	Марки.Ссылка В (&Марки)";
	Запрос.УстановитьПараметр("Марки", ДокументОбъект.АкцизныеМарки.ВыгрузитьКолонку("АкцизнаяМарка"));
	РеквизитыМарок = Запрос.Выполнить().Выгрузить();
	РеквизитыМарок.Индексы.Добавить("АкцизнаяМарка");
	
	Для Каждого СтрокаАкцизныеМарки Из ДокументОбъект.АкцизныеМарки Цикл
		
		РеквизитыМарки = РеквизитыМарок.Найти(СтрокаАкцизныеМарки.АкцизнаяМарка, "АкцизнаяМарка");
		Если РеквизитыМарки = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		ПараметрыОтбора = Новый Структура;
		ПараметрыОтбора.Вставить("Номенклатура", РеквизитыМарки.Номенклатура);
		ПараметрыОтбора.Вставить("Характеристика", РеквизитыМарки.Характеристика);
		
		ПредставлениеМарки = Строка(СтрокаАкцизныеМарки.АкцизнаяМарка);
		
		Для Каждого СтрокаТовары Из ДокументОбъект.Товары.НайтиСтроки(ПараметрыОтбора) Цикл
			Если ПустаяСтрока(СтрокаТовары.QR) Тогда
				СтрокаТовары.QR = ПредставлениеМарки;
			Иначе
				СтрокаТовары.QR = СтрокаТовары.QR + Символ(169) + ПредставлениеМарки;
			КонецЕсли;
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры
